Revit 2027 API
ConnectorElement.IsSystemClassificationValid Method
 Checks that the MEPSystemType is valid for the domain of connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSystemClassificationValid(
	MEPSystemClassification systemClassification
)
Public Function IsSystemClassificationValid (
	systemClassification As MEPSystemClassification
) As Boolean
public:
bool IsSystemClassificationValid(
	MEPSystemClassification systemClassification
)
member IsSystemClassificationValid :
        systemClassification : MEPSystemClassification -> bool
Parameters
systemClassification MEPSystemClassification
 The MEPSystemType to be validated.
Return Value
Boolean
 True if the MEPSystemType is valid for the domain of the connector, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace